game-bot/src/Enums/СтатусыПоискКино/СтатусыПоискКино.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПоискКино</name>
  <enumValues>
    <name>Приветствие</name>
  </enumValues>
  <enumValues>
    <name>ВыборФильма</name>
  </enumValues>
  <enumValues>
    <name>СтраницаФильма</name>
  </enumValues>
  <enumValues>
    <name>ФактыОФильме</name>
  </enumValues>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>ВводФразыФильм</name>
  </enumValues>
  <enumValues>
    <name>ВводФразыАктёр</name>
  </enumValues>
  <enumValues>
    <name>ВыборАктёра</name>
  </enumValues>
  <enumValues>
    <name>ФразаФильм</name>
  </enumValues>
  <enumValues>
    <name>ФразаАктёр</name>
  </enumValues>
  <enumValues>
    <name>СтраницаАктера</name>
  </enumValues>
  <enumValues>
    <name>ФактыОбАктере</name>
  </enumValues>
</mdclass:Enum>

game-bot/src/CommonModules/ТелеграмПоискКино/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработчик элемента очереди в режиме работы бота - Тест с расшифровкой
// 
// Параметры:
//  ДанныеЭлемента - Структура
//  Отправитель - СправочникСсылка.УчетныеЗаписиТелеграм
Процедура ПриОбработкеЭлементаОчереди(ДанныеЭлемента, Отправитель) Экспорт

	ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);

	Если ДанныеЭлемента.Свойство("callback_query") Тогда

		CallbackData = ДанныеЭлемента.callback_query.data;
		Если СтрНачинаетсяС(CallbackData, "film_") Тогда
			
			Если СтрНачинаетсяС(CallbackData, "film_facts_") Тогда
				ОбработатьДействиеСтраницыФактовФильма(ДанныеЭлемента.callback_query, Отправитель, ТекущийСтатус);
				Возврат;
			КонецЕсли;
	
			Если СтрНачинаетсяС(CallbackData, "film_action_") Тогда
				ОбработатьДействиеСтраницыФильма(ДанныеЭлемента.callback_query, Отправитель, ТекущийСтатус);
				Возврат;
			КонецЕсли;
	
			Если СтрНачинаетсяС(CallbackData, "film_") Тогда
				ОбработатьВыборФильма(ДанныеЭлемента.callback_query, Отправитель, ТекущийСтатус);
				Возврат;
			КонецЕсли;
			
		ИначеЕсли СтрНачинаетсяС(CallbackData, "actor_") Тогда
			
			Если СтрНачинаетсяС(CallbackData, "actor_facts_") Тогда
				ОбработатьДействиеСтраницыФактовАктера(ДанныеЭлемента.callback_query, Отправитель, ТекущийСтатус);
				Возврат;
			КонецЕсли;
			
			Если СтрНачинаетсяС(CallbackData, "actor_action_") Тогда
				ОбработатьДействиеСтраницыАктера(ДанныеЭлемента.callback_query, Отправитель, ТекущийСтатус);
				Возврат;
			КонецЕсли;
			
			Если СтрНачинаетсяС(CallbackData, "actor_") Тогда
				ОбработатьВыборАктера(ДанныеЭлемента.callback_query, Отправитель, ТекущийСтатус);
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	Если ДанныеЭлемента.Свойство("message") Тогда

		Сообщение = ДанныеЭлемента.message;

		Если Не Сообщение.Свойство("from") Или Не Сообщение.Свойство("text") Тогда
			Возврат;
		КонецЕсли;

		Текст = Сообщение.text;

		Если ТекущийСтатус = Неопределено Или СтрНачинаетсяС(Текст, "/start") Тогда
			ОтправитьПриветствие(Отправитель);

		ИначеЕсли ТекущийСтатус.Статус = Перечисления.СтатусыПоискКино.Приветствие Тогда
			Если Текст = КомандаПоискФильма() Тогда
				ОтправитьВопросОПоискеФильма(Отправитель);
			ИначеЕсли Текст = КомандаПоискАктёра() Тогда
				ОтправитьВопросОПоискеАктёра(Отправитель);
			Иначе
				ОтправитьПриветствие(Отправитель);
			КонецЕсли;

		ИначеЕсли ТекущийСтатус.Статус = Перечисления.СтатусыПоискКино.ВводФразыФильм Тогда
			НачатьПоискФильма(Отправитель, Текст, ТекущийСтатус);
		ИначеЕсли ТекущийСтатус.Статус = Перечисления.СтатусыПоискКино.ВводФразыАктёр Тогда
			НачатьПоискАктера(Отправитель, Текст, ТекущийСтатус);
		Иначе
			ОтправитьПриветствие(Отправитель);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ОбработатьДействиеСтраницыФактовФильма(ДанныеCallback, Отправитель, ТекущийСтатус)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
	
	CallbackData = ДанныеCallback.data;
	
	ДанныеБезПрефикса = СтрЗаменить(CallbackData, "film_facts_", "");
	Части = СтрРазделить(ДанныеБезПрефикса, "_", Ложь);
	
	Если Части.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Действие = Части[0];
	FilmId = Части[1];
	НомерСтраницы = ?(Части.Количество() > 2, Число(Части[2]), 1);
	
	ИдентификаторЧата = ДанныеCallback.message.chat.id;
	ИдСообщения = ДанныеCallback.message.message_id;
	
	Если Действие = "show" Тогда
			// Первый показ фактов (страница 1)
			ПоказатьФактыОФильме(Отправитель, FilmId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус, 1);
			
	ИначеЕсли Действие = "prev" Тогда
			// Предыдущая страница
			ПоказатьФактыОФильме(Отправитель, FilmId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус, НомерСтраницы);
			
	ИначеЕсли Действие = "next" Тогда
			// Следующая страница
			ПоказатьФактыОФильме(Отправитель, FilmId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус, НомерСтраницы);
			
	ИначеЕсли Действие = "back" Тогда
			// Возврат к странице фильма
			ВернутьсяКРодительскомуКонтекстуФильма(Отправитель, FilmId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус);
		Иначе
			// Неизвестное действие
			Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДействиеСтраницыФактовАктера(ДанныеCallback, Отправитель, ТекущийСтатус)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
	
	CallbackData = ДанныеCallback.data;
	
	ДанныеБезПрефикса = СтрЗаменить(CallbackData, "actor_facts_", "");
	Части = СтрРазделить(ДанныеБезПрефикса, "_", Ложь);
	
	Если Части.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Действие = Части[0];
	ActorId = Части[1];
	НомерСтраницы = ?(Части.Количество() > 2, Число(Части[2]), 1);
	
	ИдентификаторЧата = ДанныеCallback.message.chat.id;
	ИдСообщения = ДанныеCallback.message.message_id;
	
	Если Действие = "show" Тогда
		ПоказатьФактыОбАктере(Отправитель, ActorId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус, 1);
		
	ИначеЕсли Действие = "prev" Тогда
		ПоказатьФактыОбАктере(Отправитель, ActorId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус, НомерСтраницы);
		
	ИначеЕсли Действие = "next" Тогда
		ПоказатьФактыОбАктере(Отправитель, ActorId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус, НомерСтраницы);
		
	ИначеЕсли Действие = "back" Тогда
		
		ВернутьсяКРодительскомуКонтекстуАктера(Отправитель, ActorId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус);
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДействиеСтраницыФильма(ДанныеCallback, Отправитель, ТекущийСтатус)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
	
	ИдентификаторЧата = ДанныеCallback.message.chat.id;
	ИдСообщения = ДанныеCallback.message.message_id;
	
	Попытка
		ИнтеграцияТелеграм.РедактироватьСообщение(
			ИдентификаторЧата, ИдСообщения, "⏳ Загружаю...");
	Исключение
		ИнтеграцияТелеграм.УдалитьСообщение(ИдентификаторЧата, ИдСообщения);
		ИнформацияСообщения = ИнтеграцияТелеграм.ОтправитьСообщениеСВозвратомId(Отправитель ,"⏳ Загружаю...");
		Если ИнформацияСообщения.Успешно Тогда
			ИДСообщения = ИнформацияСообщения.ИдентификаторСообщения;
			ИдентификаторЧата = ИнформацияСообщения.ИдентификаторЧата;
		КонецЕсли;
	КонецПопытки;
	
	CallbackData = ДанныеCallback.data;
	
	ДанныеБезПрефикса = СтрЗаменить(CallbackData, "film_action_", "");
	ПозицияПодчёркивания = СтрНайти(ДанныеБезПрефикса, "_");
	
	Если ПозицияПодчёркивания = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Действие = Лев(ДанныеБезПрефикса, ПозицияПодчёркивания - 1);
	FilmId = Сред(ДанныеБезПрефикса, ПозицияПодчёркивания + 1);
	
	Если Действие = "facts" Тогда
		ПоказатьФактыОФильме(Отправитель, FilmId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус, 1);
	ИначеЕсли Действие =  "awards" Тогда
//			ПоказатьНаградыФильма(Отправитель, FilmId, ИдентификаторЧата, ИдСообщения);
	ИначеЕсли Действие = "similar" Тогда
//			ПоказатьПохожиеФильмы(Отправитель, FilmId, ИдентификаторЧата, ИдСообщения);
	ИначеЕсли Действие = "gallery" Тогда
//			ПоказатьГалереюФильма(Отправитель, FilmId, ИдентификаторЧата, ИдСообщения);
	ИначеЕсли Действие = "reviews" Тогда
//			ПоказатьРецензииФильма(Отправитель, FilmId, ИдентификаторЧата, ИдСообщения);
	ИначеЕсли Действие = "back" Тогда
		ВернутьсяКРодительскомуКонтекстуФильма(Отправитель, FilmId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус);	
	Иначе
		ВызватьИсключение "Неизвестное действие";
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьДействиеСтраницыАктера(ДанныеCallback, Отправитель, ТекущийСтатус)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
	
	ИдентификаторЧата = ДанныеCallback.message.chat.id;
	ИдСообщения = ДанныеCallback.message.message_id;
	
	Попытка
		ИнтеграцияТелеграм.РедактироватьСообщение(
			ИдентификаторЧата, ИдСообщения, "⏳ Загружаю...");
	Исключение
		ИнтеграцияТелеграм.УдалитьСообщение(ИдентификаторЧата, ИдСообщения);
		ИнформацияСообщения = ИнтеграцияТелеграм.ОтправитьСообщениеСВозвратомId(Отправитель ,"⏳ Загружаю...");
		Если ИнформацияСообщения.Успешно Тогда
			ИДСообщения = ИнформацияСообщения.ИдентификаторСообщения;
			ИдентификаторЧата = ИнформацияСообщения.ИдентификаторЧата;
		КонецЕсли;
	КонецПопытки;
	
	CallbackData = ДанныеCallback.data;
	
	ДанныеБезПрефикса = СтрЗаменить(CallbackData, "actor_action_", "");
	ПозицияПодчёркивания = СтрНайти(ДанныеБезПрефикса, "_");
	
	Если ПозицияПодчёркивания = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Действие = Лев(ДанныеБезПрефикса, ПозицияПодчёркивания - 1);
	ActorId = Сред(ДанныеБезПрефикса, ПозицияПодчёркивания + 1);
	
	Если Действие = "facts" Тогда
		ПоказатьФактыОбАктере(Отправитель, ActorId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус, 1);
	ИначеЕсли Действие = "back" Тогда
		ВернутьсяКРодительскомуКонтекстуАктера(Отправитель, ActorId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус);	
	Иначе
		ВызватьИсключение "Неизвестное действие";
	КонецЕсли;
	
КонецПроцедуры

Процедура ВернутьсяКРодительскомуКонтекстуФильма(Отправитель, FilmId, ТекущийИдЧата, ТекущийИдСообщения, ТекущийСтатус)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
	
	Если ТекущийСтатус = Неопределено ИЛИ ТекущийСтатус.ДополнительныеДанные = Неопределено Тогда
		ОтправитьПриветствие(Отправитель);
		Возврат;
	КонецЕсли;
	
	Кеш = ТекущийСтатус.ДополнительныеДанные.Получить();
	
	Если Не Кеш.Свойство("РодительскийКонтекст") Тогда
		ОтправитьПриветствие(Отправитель);
		Возврат;
	КонецЕсли;
	
	Родитель = Кеш.РодительскийКонтекст;
	
	Если Родитель.Статус = Перечисления.СтатусыПоискКино.ВыборФильма Тогда
		ВосстановитьВыборФильма(Отправитель, Родитель.Данные, ТекущийИдЧата, ТекущийИдСообщения);
		
	ИначеЕсли Родитель.Статус = Перечисления.СтатусыПоискКино.СтраницаФильма Тогда
		ВосстановитьСтраницуФильма(Отправитель, Родитель.Данные, ТекущийИдЧата, ТекущийИдСообщения, ТекущийСтатус);
		
	Иначе
		ОтправитьПриветствие(Отправитель);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВернутьсяКРодительскомуКонтекстуАктера(Отправитель, ActorId, ТекущийИдЧата, ТекущийИдСообщения, ТекущийСтатус)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
	
	Если ТекущийСтатус = Неопределено ИЛИ ТекущийСтатус.ДополнительныеДанные = Неопределено Тогда
		ОтправитьПриветствие(Отправитель);
		Возврат;
	КонецЕсли;
	
	Кеш = ТекущийСтатус.ДополнительныеДанные.Получить();
	
	Если Не Кеш.Свойство("РодительскийКонтекст") Тогда
		ОтправитьПриветствие(Отправитель);
		Возврат;
	КонецЕсли;
	
	Родитель = Кеш.РодительскийКонтекст;
	
	Если Родитель.Статус = Перечисления.СтатусыПоискКино.ВыборАктёра Тогда
		ВосстановитьВыборАктера(Отправитель, Родитель.Данные, ТекущийИдЧата, ТекущийИдСообщения);
		
	ИначеЕсли Родитель.Статус = Перечисления.СтатусыПоискКино.СтраницаАктера Тогда
		ВосстановитьСтраницуАктера(Отправитель, Родитель.Данные, ТекущийИдЧата, ТекущийИдСообщения, ТекущийСтатус);
	Иначе
		ОтправитьПриветствие(Отправитель);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВосстановитьВыборФильма(Отправитель, Данные, ИдЧата, ИдСообщения)
	
	МассивФильмов = Данные.МассивФильмов;
	ВсегоНайдено = Данные.ВсегоНайдено;
	
	ТекстСообщения = "🎬 Найдено: " + ВсегоНайдено + ". Выберите фильм:";
	Клавиатура = Клавиатуры.КлавиатураФильмовInline(МассивФильмов);
	
	ДопСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДопСвойства.Клавиатура = Клавиатура;
	
	Попытка
		ИнтеграцияТелеграм.РедактироватьСообщение(
			ИдЧата, ИдСообщения, ТекстСообщения, ДопСвойства);
	Исключение
		ИнтеграцияТелеграм.УдалитьСообщение(ИдЧата, ИдСообщения);
		ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстСообщения, ДопСвойства);
	КонецПопытки;
	
	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ВыборФильма, Данные);
	
КонецПроцедуры

Процедура ВосстановитьВыборАктера(Отправитель, Данные, ИдЧата, ИдСообщения)
	
	МассивАктеров = Данные.МассивАктеров;
	ВсегоНайдено = Данные.ВсегоНайдено;
	
	ТекстСообщения = "🎭 Найдено актёров: " + ВсегоНайдено + ". Выберите актера:";
	Клавиатура = Клавиатуры.КлавиатураАктеровInline(МассивАктеров);
	
	ДопСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДопСвойства.Клавиатура = Клавиатура;
	
	Попытка
		ИнтеграцияТелеграм.РедактироватьСообщение(
			ИдЧата, ИдСообщения, ТекстСообщения, ДопСвойства);
	Исключение
		ИнтеграцияТелеграм.УдалитьСообщение(ИдЧата, ИдСообщения);
		ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстСообщения, ДопСвойства);
	КонецПопытки;
	
	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ВыборАктёра, Данные);
	
КонецПроцедуры

Процедура ВосстановитьСтраницуФильма(Отправитель, Данные, ТекущийИдЧата, ТекущийИдСообщения, ТекущийСтатус)
	
	Если Не Данные.Свойство("ИДФильма") ИЛИ Не Данные.Свойство("ТекстДеталей") Тогда
		ДеталиФильма = ЗапросДеталейФильмаПоId(Отправитель, Данные.ИДФильма);
		Если ДеталиФильма <> Неопределено Тогда
			ПоказатьДеталиФильма(Отправитель, ДеталиФильма, ТекущийИдСообщения, ТекущийИдЧата, ТекущийСтатус);
		Иначе
			ОтправитьПриветствие(Отправитель);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ИДФильма = Данные.ИДФильма;
	ТекстДеталей = Данные.ТекстДеталей;
	Обложка = ?(Данные.Свойство("Обложка"), Данные.Обложка, Неопределено);
	ИдЧата = ?(Данные.Свойство("ИдЧата"), Данные.ИдЧата, ТекущийИдЧата);
	
	Клавиатура = Клавиатуры.КлавиатураСтраницыФильма(ИДФильма);
	ДопСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДопСвойства.Клавиатура = Клавиатура;
	
	Попытка
		Если Обложка <> Неопределено Тогда
			ИнтеграцияТелеграм.УдалитьСообщение(ИдЧата, ТекущийИдСообщения);
			ИнтеграцияТелеграм.ОтправитьКартинку(Отправитель, Обложка, ТекстДеталей, ДопСвойства);
		Иначе
			ИнтеграцияТелеграм.РедактироватьСообщение(
				ИдЧата, ТекущийИдСообщения, ТекстДеталей, ДопСвойства);
		КонецЕсли;
		
	Исключение
		Если Обложка <> Неопределено Тогда
			ИнтеграцияТелеграм.ОтправитьКартинку(Отправитель, Обложка, ТекстДеталей, ДопСвойства);
		Иначе
			ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстДеталей, ДопСвойства);
		КонецЕсли;
	КонецПопытки;
	
	КэшФильма = Новый Структура;
	КэшФильма.Вставить("ИДФильма", ИДФильма);
	КэшФильма.Вставить("ТекстДеталей", ТекстДеталей);
	КэшФильма.Вставить("Обложка", Обложка);
	КэшФильма.Вставить("ИдЧата", ИдЧата);
	КэшФильма.Вставить("ДатаКеширования", ТекущаяДатаСеанса());
	
	Если Данные.Свойство("РодительскийКонтекст") Тогда
		КэшФильма.Вставить("РодительскийКонтекст", Данные.РодительскийКонтекст);
	КонецЕсли;
	
	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.СтраницаФильма, КэшФильма);
	
КонецПроцедуры

Процедура ВосстановитьСтраницуАктера(Отправитель, Данные, ТекущийИдЧата, ТекущийИдСообщения, ТекущийСтатус)
	
	Если Не Данные.Свойство("ИДАктера") ИЛИ Не Данные.Свойство("ТекстОбАктёре") Тогда

		ДеталиАктера = ЗапросДеталейАктераПоId(Отправитель, Данные.ИДАктера);
		Если ДеталиАктера <> Неопределено Тогда
			ПоказатьДеталиАктера(Отправитель, ДеталиАктера, ТекущийИдСообщения, ТекущийИдЧата, ТекущийСтатус);
		Иначе
			ОтправитьПриветствие(Отправитель);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ИДАктера = Данные.ИДАктера;
	ТекстОбАктёре = Данные.ТекстОбАктёре;
	Обложка = ?(Данные.Свойство("Обложка"), Данные.Обложка, Неопределено);
	ИдЧата = ?(Данные.Свойство("ИдЧата"), Данные.ИдЧата, ТекущийИдЧата);
	
	Клавиатура = Клавиатуры.КлавиатураСтраницыАктера(ИДАктера);
	ДопСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДопСвойства.Клавиатура = Клавиатура;
	
	Попытка
		Если Обложка <> Неопределено Тогда
			ИнтеграцияТелеграм.УдалитьСообщение(ИдЧата, ТекущийИдСообщения);
			ИнтеграцияТелеграм.ОтправитьКартинку(Отправитель, Обложка, ТекстОбАктёре, ДопСвойства);
		Иначе
			ИнтеграцияТелеграм.РедактироватьСообщение(
				ИдЧата, ТекущийИдСообщения, ТекстОбАктёре, ДопСвойства);
		КонецЕсли;
	Исключение
		Если Обложка <> Неопределено Тогда
			ИнтеграцияТелеграм.ОтправитьКартинку(Отправитель, Обложка, ТекстОбАктёре, ДопСвойства);
		Иначе
			ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстОбАктёре, ДопСвойства);
		КонецЕсли;
	КонецПопытки;
	
	КэшАктера = Новый Структура;
	КэшАктера.Вставить("ИДАктера", ИДАктера);
	КэшАктера.Вставить("ТекстОбАктёре", ТекстОбАктёре);
	КэшАктера.Вставить("Обложка", Обложка);
	КэшАктера.Вставить("ИдЧата", ИдЧата);
	КэшАктера.Вставить("ДатаКеширования", ТекущаяДатаСеанса());
	
	Если Данные.Свойство("РодительскийКонтекст") Тогда
		КэшАктера.Вставить("РодительскийКонтекст", Данные.РодительскийКонтекст);
	КонецЕсли;
	
	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.СтраницаАктера, КэшАктера);
	
КонецПроцедуры

Процедура ПоказатьФактыОФильме(Отправитель, FilmId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус, НомерСтраницы = 1)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
	
	КешФактов = Неопределено;
	
	Если ТекущийСтатус <> Неопределено И ТекущийСтатус.ДополнительныеДанные <> Неопределено Тогда
		ДанныеСтатуса = ТекущийСтатус.ДополнительныеДанные.Получить();
		Если ДанныеСтатуса.Свойство("МассивФактов") И ДанныеСтатуса.Свойство("FilmId") И ДанныеСтатуса.FilmId = FilmId Тогда
			КешФактов = ДанныеСтатуса;
		КонецЕсли;
	КонецЕсли;
	
	Если КешФактов = Неопределено Тогда
		
		ИнтеграцияТелеграм.РедактироватьСообщение(
			ИдентификаторЧата, ИдСообщения, "🤫 Загружаю интересные факты... ⏳");
		
		Ответ = ЗапросДеталейФильмаПоId(Отправитель, FilmId, "/facts");
		
		Если Ответ = Неопределено Тогда
			ИнтеграцияТелеграм.РедактироватьСообщение(
				ИдентификаторЧата, ИдСообщения, "😔 Не удалось загрузить факты. Попробуйте позже.");
			Возврат;
		КонецЕсли;
		
		ДанныеФактов = ОбработатьJSON(Отправитель, Ответ);
		
		Если Не ДанныеФактов.Свойство("items") Тогда
			ИнтеграцияТелеграм.РедактироватьСообщение(
				ИдентификаторЧата, ИдСообщения, "😔 Факты не найдены для этого фильма.");
			Возврат;
		КонецЕсли;
		
		КешФактов = Новый Структура;
		КешФактов.Вставить("FilmId", FilmId);
		КешФактов.Вставить("ВсегоФактов", ДанныеФактов["total"]);
		КешФактов.Вставить("МассивФактов", ДанныеФактов["items"]);
		КешФактов.Вставить("ТекущаяСтраница", 1);
		КешФактов.Вставить("ФактовНаСтранице", 3);
		
	Иначе
		КешФактов.ТекущаяСтраница = НомерСтраницы;
	КонецЕсли;
	
	ФактовНаСтранице = КешФактов.ФактовНаСтранице;
	НачальныйИндекс = (КешФактов.ТекущаяСтраница - 1) * ФактовНаСтранице;
	КонечныйИндекс = Мин(НачальныйИндекс + ФактовНаСтранице, КешФактов.ВсегоФактов);
	
	ТекстФактов = "🎬 <b>Интересные факты о фильме</b>" + Символы.ПС + Символы.ПС;
	
	Для Индекс = НачальныйИндекс По КонечныйИндекс - 1 Цикл
		Факт = КешФактов.МассивФактов[Индекс];
		ТипФакта = ?(Факт.Свойство("type"), Факт["type"], "FACT");
		ТекстФакта = Факт["text"];
		ТекстФакта = РаботаСТекстом.ОчиститьТекстОтHTML(ТекстФакта);
		Спойлер = ?(Факт.Свойство("spoiler"), Факт["spoiler"], Ложь);
		
		Эмодзи = "💡";
		Если ТипФакта = "BLOOPER" Тогда
			Эмодзи = "🎬";
		КонецЕсли;
		
		ТекстФактов = ТекстФактов + Эмодзи + " " + ТекстФакта + Символы.ПС;
	КонецЦикла;
	
	ВсегоСтраниц = Окр(КешФактов.ВсегоФактов / ФактовНаСтранице, 0, РежимОкругления.Окр15как20);
	
	Клавиатура = Клавиатуры.КлавиатураФактовФильма(FilmId, КешФактов.ТекущаяСтраница, ВсегоСтраниц);
	ДопСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДопСвойства.Клавиатура = Клавиатура;
	
	Попытка
		ИнтеграцияТелеграм.РедактироватьСообщение(
			ИдентификаторЧата, ИдСообщения, ТекстФактов, ДопСвойства);
	Исключение
		ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстФактов, ДопСвойства);
	КонецПопытки;
	
	Если ТекущийСтатус <> Неопределено И ТекущийСтатус.ДополнительныеДанные <> Неопределено Тогда

		Если ТекущийСтатус.Статус = Перечисления.СтатусыПоискКино.СтраницаФильма Тогда
			КешФактов.Вставить("РодительскийКонтекст", Новый Структура(
				"Статус, Данные",
				Перечисления.СтатусыПоискКино.СтраницаФильма,
				ТекущийСтатус.ДополнительныеДанные.Получить()));
		КонецЕсли;
	КонецЕсли;
	
	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ФактыОФильме, КешФактов);
	
КонецПроцедуры

Процедура ПоказатьФактыОбАктере(Отправитель, ActorId, ИдентификаторЧата, ИдСообщения, ТекущийСтатус, НомерСтраницы = 1)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
	
	КешФактов = Неопределено;
	Если ТекущийСтатус <> Неопределено И ТекущийСтатус.ДополнительныеДанные <> Неопределено Тогда
		ДанныеСтатуса = ТекущийСтатус.ДополнительныеДанные.Получить();
		Если ДанныеСтатуса.Свойство("МассивФактов") И ДанныеСтатуса.Свойство("ActorId") И ДанныеСтатуса.ActorId = ActorId Тогда
			КешФактов = ДанныеСтатуса;
		КонецЕсли;
	КонецЕсли;
	
	Если КешФактов = Неопределено Тогда
		
		ИнтеграцияТелеграм.РедактироватьСообщение(
			ИдентификаторЧата, ИдСообщения, "🤫 Загружаю интересные факты об актёре... ⏳");
		
		Ответ = ЗапросДеталейАктераПоId(Отправитель, ActorId);
		
		Если Ответ = Неопределено Тогда
			ИнтеграцияТелеграм.РедактироватьСообщение(
				ИдентификаторЧата, ИдСообщения, "😔 Не удалось загрузить факты. Попробуйте позже.");
			Возврат;
		КонецЕсли;
		
		ДанныеАктера = ОбработатьJSON(Отправитель, Ответ);
		
		Если Не ДанныеАктера.Свойство("facts") ИЛИ ДанныеАктера["facts"] = Неопределено Тогда
			ИнтеграцияТелеграм.РедактироватьСообщение(
				ИдентификаторЧата, ИдСообщения, "😔 Факты не найдены для этого актёра.");
			Возврат;
		КонецЕсли;
		
		МассивФактов = ДанныеАктера["facts"];
		
		КешФактов = Новый Структура;
		КешФактов.Вставить("ActorId", ActorId);
		КешФактов.Вставить("ВсегоФактов", МассивФактов.Количество());
		КешФактов.Вставить("МассивФактов", МассивФактов);
		КешФактов.Вставить("ТекущаяСтраница", 1);
		КешФактов.Вставить("ФактовНаСтранице", 3);
		
	Иначе
		КешФактов.ТекущаяСтраница = НомерСтраницы;
	КонецЕсли;
	
	ФактовНаСтранице = КешФактов.ФактовНаСтранице;
	НачальныйИндекс = (КешФактов.ТекущаяСтраница - 1) * ФактовНаСтранице;
	КонечныйИндекс = Мин(НачальныйИндекс + ФактовНаСтранице, КешФактов.ВсегоФактов);
	
	ТекстФактов = "🎭 <b>Интересные факты об актёре</b>" + Символы.ПС + Символы.ПС;
	
	Для Индекс = НачальныйИндекс По КонечныйИндекс - 1 Цикл
		Факт = КешФактов.МассивФактов[Индекс];
		
		ТекстФакта = РаботаСТекстом.ОчиститьТекстОтHTML(Факт);
		
		Эмодзи = "💡";
		
		ТекстФактов = ТекстФактов + Эмодзи + " " + ТекстФакта + Символы.ПС;
	КонецЦикла;
	
	ВсегоСтраниц = Окр(КешФактов.ВсегоФактов / ФактовНаСтранице, 0, РежимОкругления.Окр15как20);
	ТекстФактов = ТекстФактов + Символы.ПС;
	
	Клавиатура = Клавиатуры.КлавиатураФактовАктера(ActorId, КешФактов.ТекущаяСтраница, ВсегоСтраниц);
	ДопСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДопСвойства.Клавиатура = Клавиатура;
	
	Попытка
		ИнтеграцияТелеграм.РедактироватьСообщение(
			ИдентификаторЧата, ИдСообщения, ТекстФактов, ДопСвойства);
	Исключение
		ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстФактов, ДопСвойства);
	КонецПопытки;
	
	Если ТекущийСтатус <> Неопределено И ТекущийСтатус.ДополнительныеДанные <> Неопределено Тогда
		Если ТекущийСтатус.Статус = Перечисления.СтатусыПоискКино.СтраницаАктера Тогда
			КешФактов.Вставить("РодительскийКонтекст", Новый Структура(
				"Статус, Данные",
				Перечисления.СтатусыПоискКино.СтраницаАктера,
				ТекущийСтатус.ДополнительныеДанные.Получить()));
		КонецЕсли;
	КонецЕсли;
	
	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ФактыОбАктере, КешФактов);
	
КонецПроцедуры

Процедура ОтправитьВопросОПоискеФильма(Отправитель)
	
	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ВводФразыФильм);
	
	ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДополнительныеСвойства.Клавиатура = Клавиатуры.УдалитьКлавиатуру();
	
	ТекстВопроса = НСтр("ru = '✍️ Введите название фильма или ключевую фразу:'");
	ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстВопроса, ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОтправитьВопросОПоискеАктёра(Отправитель)
	
	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ВводФразыАктёр);
	
	ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДополнительныеСвойства.Клавиатура = Клавиатуры.УдалитьКлавиатуру();
	
	ТекстВопроса = НСтр("ru = '✍️ Введите имя актёра для поиска:'");
	ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстВопроса, ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОтправитьПриветствие(Отправитель)
	ТекстПриветствия = НСтр(
			"ru = '🎬 Добро пожаловать в ПоискКино! 
			|
			|Я ваш персональный помощник в мире кино. С моей помощью вы можете:
			|
			|🔍 Искать фильмы по названию или ключевым словам
			|🎭 Узнавать информацию об актёрах
			|📚 Получать интересные факты о фильмах
			|🎥 Находить похожие фильмы
			|🖼️ Получать изображения:
			|   • Кадры из фильмов и со съёмок
			|   • Постеры и обложки
			|   • Фан-арты и концепт-арты
			|   • Промо-материалы и обои
			|   • Скриншоты
			|✍️ Читать рецензии
			|
			|Начните поиск прямо сейчас 👇'");
			
	ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДополнительныеСвойства.Клавиатура = Клавиатуры.КлавиатураДвеКнопки(КомандаПоискФильма(), КомандаПоискАктёра());

	ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстПриветствия, ДополнительныеСвойства);
	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.Приветствие);

КонецПроцедуры

Процедура НачатьПоискФильма(Отправитель, Текст, ТекущийСтатус)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
	
	ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	
	ТекстСообщения = СтрШаблон("Начинаю поиск по ключевой фразе: %1", Текст);
	ДанныеСообщения = ИнтеграцияТелеграм.ОтправитьСообщениеСВозвратомId(Отправитель, 
																		ТекстСообщения, 
																		ДополнительныеСвойства);
	ИдСообщения = ДанныеСообщения.ИдентификаторСообщения;
	ИдЧата = ДанныеСообщения.ИдентификаторЧата;
	
	Результат = ЗапросКСерверуПоискФильма(Отправитель, Текст);
	
	Если Результат = 1 Тогда
		ТекстСообщения = СтрШаблон("😔 По запросу ""%1"" фильмы не найдены. Попробуйте другой запрос.", Текст);
		ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
		ДополнительныеСвойства.Клавиатура = Клавиатуры.КлавиатураДвеКнопки(КомандаПоискФильма(), КомандаПоискАктёра());
		
		Попытка
			ИнтеграцияТелеграм.РедактироватьСообщение(ИдЧата, ИдСообщения, ТекстСообщения, ДополнительныеСвойства);
		Исключение
			ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстСообщения, ДополнительныеСвойства);
		КонецПопытки;
		
		РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ВводФразыФильм);
		
		Возврат;
		
	ИначеЕсли Результат = 2 Тогда
		ТекстСообщения = СтрШаблон("Ошибка поиска по ключевой фразе ""%1"", попробуйте ещё раз", Текст);
		ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
		ДополнительныеСвойства.Клавиатура = Клавиатуры.КлавиатураДвеКнопки(КомандаПоискФильма(), КомандаПоискАктёра());
		
		Попытка
			ИнтеграцияТелеграм.РедактироватьСообщение(ИдЧата, ИдСообщения, ТекстСообщения, ДополнительныеСвойства);
		Исключение
			ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстСообщения, ДополнительныеСвойства);
		КонецПопытки;
		
		РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ВводФразыФильм);
		
		Возврат;
		
	Иначе
		
		ОбработанныйРезультат = ОбработатьJSON(Отправитель, Результат);
		
		ПоказатьРезультатыПоискаФильмов(Отправитель, ОбработанныйРезультат, ИдСообщения, ИдЧата);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПоискАктера(Отправитель, Текст, ТекущийСтатус)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
	
	ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	
	ТекстСообщения = СтрШаблон("Начинаю поиск по ключевой фразе: %1", Текст);
	ДанныеСообщения = ИнтеграцияТелеграм.ОтправитьСообщениеСВозвратомId(Отправитель, 
																		ТекстСообщения, 
																		ДополнительныеСвойства);
	ИдСообщения = ДанныеСообщения.ИдентификаторСообщения;
	ИдЧата = ДанныеСообщения.ИдентификаторЧата;
	
	Результат = ЗапросКСерверуПоискАктера(Отправитель, Текст);
	
	Если Результат = 1 Тогда
		ТекстСообщения = СтрШаблон("😔 По запросу ""%1"" актёры не найдены. Попробуйте другой запрос.", Текст);
		ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
		ДополнительныеСвойства.Клавиатура = Клавиатуры.КлавиатураДвеКнопки(КомандаПоискФильма(), КомандаПоискАктёра());
		
		Попытка
			ИнтеграцияТелеграм.РедактироватьСообщение(ИдЧата, ИдСообщения, ТекстСообщения, ДополнительныеСвойства);
		Исключение
			ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстСообщения, ДополнительныеСвойства);
		КонецПопытки;
		
		РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ВводФразыАктёр);
		
		Возврат;
		
	ИначеЕсли Результат = 2 Тогда
		ТекстСообщения = СтрШаблон("Ошибка поиска по ключевой фразе ""%1"", попробуйте ещё раз", Текст);
		ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
		ДополнительныеСвойства.Клавиатура = Клавиатуры.КлавиатураДвеКнопки(КомандаПоискФильма(), КомандаПоискАктёра());
		
		Попытка
			ИнтеграцияТелеграм.РедактироватьСообщение(ИдЧата, ИдСообщения, ТекстСообщения, ДополнительныеСвойства);
		Исключение
			ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстСообщения, ДополнительныеСвойства);
		КонецПопытки;
		
		РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ВводФразыАктёр);
		
		Возврат;
		
	Иначе
		
		ОбработанныйРезультат = ОбработатьJSON(Отправитель, Результат);
		
		ПоказатьРезультатыПоискаАктеров(Отправитель, ОбработанныйРезультат, ИдСообщения, ИдЧата);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьРезультатыПоискаФильмов(Отправитель, ОбработанныйРезультат, ИдСообщения, ИдЧата)

	МассивФильмов = Новый Массив;
	Счётчик = 0;
	
	Для Каждого Фильм Из ОбработанныйРезультат["films"] Цикл
		Если Счётчик >= 5 Тогда Прервать; КонецЕсли;
		
		СтруктураФильма = Новый Структура;
		СтруктураФильма.Вставить("id", Строка(Фильм["filmId"]));
		СтруктураФильма.Вставить("Название", ?(Фильм.Свойство("nameRu"), Фильм["nameRu"], Фильм["nameEn"]));
		СтруктураФильма.Вставить("ГодВыпуска", ?(Фильм.Свойство("year") И Фильм["year"] <> "null", Фильм["year"], ""));
		
		МассивФильмов.Добавить(СтруктураФильма);
		Счётчик = Счётчик + 1;
	КонецЦикла;
	
	Если МассивФильмов.Количество() = 0 Тогда
		ТекстСообщения = "😔 Фильмы не найдены. Попробуйте другой запрос."; 
		ИнтеграцияТелеграм.РедактироватьСообщение(ИдЧата, ИдСообщения, ТекстСообщения);
		Возврат;
	КонецЕсли;

	ТекстСообщения = "🎬 Найдено: " + ОбработанныйРезультат["searchFilmsCountResult"] + ". Выберите фильм:";

	Клавиатура = Клавиатуры.КлавиатураФильмовInline(МассивФильмов);

	ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДополнительныеСвойства.Клавиатура = Клавиатура;
	
	Попытка
		ИнтеграцияТелеграм.РедактироватьСообщение(ИдЧата, ИдСообщения, ТекстСообщения, ДополнительныеСвойства);
	Исключение
		ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстСообщения, ДополнительныеСвойства);
	КонецПопытки;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("МассивФильмов", МассивФильмов);
	СтруктураДанных.Вставить("ВсегоНайдено", ОбработанныйРезультат["searchFilmsCountResult"]);

	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ВыборФильма, СтруктураДанных);
	
КонецПроцедуры

Процедура ПоказатьРезультатыПоискаАктеров(Отправитель, ОбработанныйРезультат, ИдСообщения, ИдЧата)

	МассивАктеров = Новый Массив;
	Счётчик = 0;
	
	Для Каждого Актер Из ОбработанныйРезультат["items"] Цикл
		Если Счётчик >= 5 Тогда Прервать; КонецЕсли;
		
		СтруктураАктера = Новый Структура;
		СтруктураАктера.Вставить("id", Строка(Актер["kinopoiskId"]));
		СтруктураАктера.Вставить("Имя", ?(Актер.Свойство("nameRu"), Актер["nameRu"], Актер["nameEn"]));
		
		МассивАктеров.Добавить(СтруктураАктера);
		Счётчик = Счётчик + 1;
	КонецЦикла;
	
	Если МассивАктеров.Количество() = 0 Тогда
		ТекстСообщения = "😔 Актеры не найдены. Попробуйте другой запрос."; 
		ИнтеграцияТелеграм.РедактироватьСообщение(ИдЧата, ИдСообщения, ТекстСообщения);
		Возврат;
	КонецЕсли;

	ТекстСообщения = "🎭 Найдено актёров: " + ОбработанныйРезультат["total"] + ". Выберите актера:";

	Клавиатура = Клавиатуры.КлавиатураАктеровInline(МассивАктеров);

	ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДополнительныеСвойства.Клавиатура = Клавиатура;
	
	Попытка
		ИнтеграцияТелеграм.РедактироватьСообщение(ИдЧата, ИдСообщения, ТекстСообщения, ДополнительныеСвойства);
	Исключение
		ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, ТекстСообщения, ДополнительныеСвойства);
	КонецПопытки;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("МассивАктеров", МассивАктеров);
	СтруктураДанных.Вставить("ВсегоНайдено", ОбработанныйРезультат["total"]);

	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ВыборАктёра, СтруктураДанных);
	
КонецПроцедуры

Процедура ОбработатьВыборФильма(ДанныеCallback, Отправитель, ТекущийСтатус)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
		
	CallbackData = ДанныеCallback.data;
	Если Не СтрНачинаетсяС(CallbackData, "film_") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "Собираю данные по фильму...";
	
	ИДСообщения = ДанныеCallback.message.message_id;
	ИдПользователя = ДанныеCallback.from.id;
	ИнтеграцияТелеграм.РедактироватьСообщение(ИдПользователя, ИДСообщения, ТекстСообщения);
	
	FilmId = РаботаСТекстом.ОчиститьИдентификатор(CallbackData, "film_");
	
	ДеталиФильма = ЗапросДеталейФильмаПоId(Отправитель, FilmId);
	
	Если ДеталиФильма = Неопределено Тогда
		ИнтеграцияТелеграм.РедактироватьСообщение(ИдПользователя, 
												  ИДСообщения, 
												  "❌ Не удалось загрузить информацию о фильме. Попробуйте ещё раз.");
		РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ВыборФильма);
		Возврат;
	КонецЕсли;
	
	ПоказатьДеталиФильма(Отправитель, ДеталиФильма, ИДСообщения, ИдПользователя, ТекущийСтатус);
КонецПроцедуры

Процедура ПоказатьДеталиФильма(Отправитель, ДеталиФильма, ИДСообщения, ИдПользователя, ТекущийСтатус)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
	
	Фильм = ОбработатьJSON(Отправитель, ДеталиФильма);
	
	Обложка = ПолучитьДвоичныеДанныеОбложки(?(Фильм.Свойство("posterUrlPreview"), 
									   Фильм["posterUrlPreview"], 
									   Фильм["posterUrl"]));
	
	Название = ?(Фильм.Свойство("nameRu"), Фильм["nameRu"], Фильм["nameOriginal"]);
	ГодВыпуска = СтрЗаменить(?(Фильм.Свойство("year"), Фильм["year"], "-"), Символы.НПП, "");
	Рейтинг = ?(Фильм.Свойство("ratingKinopoisk"), Фильм["ratingKinopoisk"], Фильм["ratingImdb"]);
	Описание = Фильм["description"];
	БезопасноеОписание = РаботаСТекстом.ЭкранироватьHTML(Описание);
	Жанры = Фильм["genres"];
	
	МассивЖанров = Новый Массив;
	Для Каждого Строка Из Жанры Цикл
		МассивЖанров.Добавить(Строка["genre"]);
	КонецЦикла;
	ЖанрыСтрока = СтрСоединить(МассивЖанров, ", ");
	
	Страны = Фильм["countries"];
	МассивСтран = Новый Массив;
	Для Каждого Строка Из Страны Цикл
		МассивСтран.Добавить(Строка["country"]);
	КонецЦикла;
	
	СтраныСтрока = СтрСоединить(МассивСтран, ", ");
	
	ТекстДеталей = СтрШаблон("
			|🎬 <b>%1</b> %2
			|
			|⭐ <b>Рейтинг:</b> %3
			|🌍 %4
			|🎭 %5
			|
			|<b>Описание:</b> <i>%6</i>",
			Название,
			ГодВыпуска,
			Рейтинг,
			СтраныСтрока,
			ЖанрыСтрока,
			СокрЛП(БезопасноеОписание));
	
	ИДФильма = РаботаСТекстом.ОчиститьИдентификатор(Фильм["kinopoiskId"], " ");
	
	Клавиатура = Клавиатуры.КлавиатураСтраницыФильма(ИДФильма);

	ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДополнительныеСвойства.Клавиатура = Клавиатура;
	
	МаксДлинаСообщения = 1024;
	
	Если Обложка = Неопределено Тогда
		ИнтеграцияТелеграм.РедактироватьСообщение(ИдПользователя, ИДСообщения, ТекстДеталей, ДополнительныеСвойства);
	Иначе
		Если СтрДлина(ТекстДеталей) > МаксДлинаСообщения Тогда
			ТекстДеталей = РаботаСТекстом.ОбрезатьТекстДляПодписи(ТекстДеталей, МаксДлинаСообщения);
		КонецЕсли;
		ИнтеграцияТелеграм.УдалитьСообщение(ИдПользователя, ИДСообщения);
		ИнтеграцияТелеграм.ОтправитьКартинку(Отправитель, Обложка, ТекстДеталей, ДополнительныеСвойства);
	КонецЕсли;
	
	РодительскийКонтекст = Неопределено;
	
	Если ТекущийСтатус <> Неопределено И ТекущийСтатус.ДополнительныеДанные <> Неопределено Тогда
		Если ТекущийСтатус.Статус = Перечисления.СтатусыПоискКино.ВыборФильма Тогда
			РодительскийКонтекст = Новый Структура;
			РодительскийКонтекст.Вставить("Статус", Перечисления.СтатусыПоискКино.ВыборФильма);
			РодительскийКонтекст.Вставить("Данные", ТекущийСтатус.ДополнительныеДанные.Получить());
		КонецЕсли;
	КонецЕсли;
	
	КэшФильма = Новый Структура;
	КэшФильма.Вставить("ИДФильма", ИДФильма);
	КэшФильма.Вставить("ТекстДеталей", ТекстДеталей);
	КэшФильма.Вставить("Обложка", Обложка);
	КэшФильма.Вставить("ИдЧата", ИдПользователя);
	КэшФильма.Вставить("ДатаКеширования", ТекущаяДатаСеанса());
	
	Если РодительскийКонтекст <> Неопределено Тогда
		КэшФильма.Вставить("РодительскийКонтекст", РодительскийКонтекст);
	КонецЕсли;
	
	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.СтраницаФильма, КэшФильма);
	
КонецПроцедуры

Процедура ОбработатьВыборАктера(ДанныеCallback, Отправитель, ТекущийСтатус)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
		
	CallbackData = ДанныеCallback.data;
	Если Не СтрНачинаетсяС(CallbackData, "actor_") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "Собираю данные по актёру...";
	
	ИДСообщения = ДанныеCallback.message.message_id;
	ИдПользователя = ДанныеCallback.from.id;
	ИнтеграцияТелеграм.РедактироватьСообщение(ИдПользователя, ИДСообщения, ТекстСообщения);
	
	ActorId = РаботаСТекстом.ОчиститьИдентификатор(CallbackData, "actor_");
	
	ДеталиАктера = ЗапросДеталейАктераПоId(Отправитель, ActorId);
	
	Если ДеталиАктера = Неопределено Тогда
		ИнтеграцияТелеграм.РедактироватьСообщение(ИдПользователя, 
												  ИДСообщения, 
												  "❌ Не удалось загрузить информацию об актёре. Попробуйте ещё раз.");
		РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.ВыборФильма);
		Возврат;
	КонецЕсли;
	
	ПоказатьДеталиАктера(Отправитель, ДеталиАктера, ИДСообщения, ИдПользователя, ТекущийСтатус);
КонецПроцедуры

Процедура ПоказатьДеталиАктера(Отправитель, ДеталиАктера, ИДСообщения, ИдПользователя, ТекущийСтатус)
	
	Если ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = РаботаСоСтатусом.СтатусОтправителя(Отправитель);
	КонецЕсли;
	
	Актер = ОбработатьJSON(Отправитель, ДеталиАктера);
	
	Обложка = ПолучитьДвоичныеДанныеОбложки(?(Актер.Свойство("posterUrl"), 
									   Актер["posterUrl"], 
									   Неопределено));
	
	Имя = ?(Актер.Свойство("nameRu"), Актер["nameRu"], Актер["nameEn"]);
	ДеньРождения = СтрЗаменить(?(Актер.Свойство("birthday"), Актер["birthday"], "-"), Символы.НПП, "");
	Возраст = ?(Актер.Свойство("age"), Актер["age"], "-");
	Рост = ?(Актер.Свойство("growth"), Актер["growth"], "-");
	ДатаСмерти = ?(Актер["death"] <> Неопределено, Актер["death"], "-");
	МестоРождения = ?(Актер.Свойство("birthplace"), Актер["birthplace"], "-");
	Профессии = ?(Актер.Свойство("profession"), Актер["profession"], "-");
	
	Если ДатаСмерти = "-" Тогда
		ТекстОбАктёре = СтрШаблон("
			|🎭 <b>%1</b>
			|
			|🎬 <b>Профессия:</b> %2
			|🎂 <b>Дата рождения:</b> %3 (%4 лет)
			|📍 <b>Место рождения:</b> %5
			|📏 <b>Рост:</b> %6 см",
			Имя,
			Профессии,
			ДеньРождения,
			Возраст,
			МестоРождения,
			Рост);
	Иначе
		ТекстОбАктёре = СтрШаблон("
			|🎭 <b>%1</b> 🕯️
			|
			|🎬 <b>Профессия:</b> %2
			|🎂 <b>Дата рождения:</b> %3
			|✝️ <b>Дата смерти:</b> %4
			|📍 <b>Место рождения:</b> %5
			|📏 <b>Рост:</b> %6 см",
			Имя,
			Профессии,
			ДеньРождения,
			ДатаСмерти,
			МестоРождения,
			Рост);
	КонецЕсли;
	
	ИДАктера = РаботаСТекстом.ОчиститьИдентификатор(Актер["personId"], " ");
	
	Клавиатура = Клавиатуры.КлавиатураСтраницыАктера(ИДАктера);

	ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
	ДополнительныеСвойства.Клавиатура = Клавиатура;
	
	МаксДлинаСообщения = 1024;
	
	Если Обложка = Неопределено Тогда
		ИнтеграцияТелеграм.РедактироватьСообщение(ИдПользователя, ИДСообщения, ТекстОбАктёре, ДополнительныеСвойства);
	Иначе
		Если СтрДлина(ТекстОбАктёре) > МаксДлинаСообщения Тогда
			ТекстОбАктёре = РаботаСТекстом.ОбрезатьТекстДляПодписи(ТекстОбАктёре, МаксДлинаСообщения);
		КонецЕсли;
		ИнтеграцияТелеграм.УдалитьСообщение(ИдПользователя, ИДСообщения);
		ИнтеграцияТелеграм.ОтправитьКартинку(Отправитель, Обложка, ТекстОбАктёре, ДополнительныеСвойства);
	КонецЕсли;
	
	РодительскийКонтекст = Неопределено;
	
	Если ТекущийСтатус <> Неопределено И ТекущийСтатус.ДополнительныеДанные <> Неопределено Тогда
		Если ТекущийСтатус.Статус = Перечисления.СтатусыПоискКино.ВыборАктёра Тогда
			РодительскийКонтекст = Новый Структура;
			РодительскийКонтекст.Вставить("Статус", Перечисления.СтатусыПоискКино.ВыборАктёра);
			РодительскийКонтекст.Вставить("Данные", ТекущийСтатус.ДополнительныеДанные.Получить());
		КонецЕсли;
	КонецЕсли;
	
	КэшАктера = Новый Структура;
	КэшАктера.Вставить("ИДАктера", ИДАктера);
	КэшАктера.Вставить("ТекстОбАктёре", ТекстОбАктёре);
	КэшАктера.Вставить("Обложка", Обложка);
	КэшАктера.Вставить("ИдЧата", ИдПользователя);
	КэшАктера.Вставить("ДатаКеширования", ТекущаяДатаСеанса());
	
	Если РодительскийКонтекст <> Неопределено Тогда
		КэшАктера.Вставить("РодительскийКонтекст", РодительскийКонтекст);
	КонецЕсли;
	
	РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.СтраницаАктера, КэшАктера);
	
КонецПроцедуры

Функция ПолучитьДвоичныеДанныеОбложки(URLартинки)
	
	АдресБезПротокола = СтрЗаменить(URLартинки, "https://", "");
	АдресСервера = Лев(АдресБезПротокола, СтрНайти(АдресБезПротокола, "/") - 1);
	СсылкаБезАдреса = Сред(АдресБезПротокола, СтрНайти(АдресБезПротокола, "/"));

	
	HTTPСоединение = Новый HTTPСоединение(АдресСервера, , , , , Истина);
		
	HTTPЗапрос = Новый HTTPЗапрос(СсылкаБезАдреса);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("X-API-KEY", Константы.КлючAPIКиноПоиск.Получить());
	
	//@skip-check bsl-legacy-check-dynamic-feature-access - Асинх только на клиенте
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Возврат Ответ.ПолучитьТелоКакДвоичныеДанные();
	ИначеЕсли Ответ.КодСостояния = 301 ИЛИ Ответ.КодСостояния = 302 Тогда
		Возврат ПолучитьДвоичныеДанныеОбложки(Ответ.Заголовки["Location"]);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ОбработатьJSON(Отправитель, Результат)
	
	СтрокаJSON = Результат.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Попытка
		Результат = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Возврат "Не удалось прочитать JSON";
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ЗапросКСерверуПоискФильма(Отправитель, Текст)
	
	АдресСервера = Константы.АдресСервера.Получить();
	КлючеваяФраза = КодироватьСтроку(Текст, СпособКодированияСтроки.URLВКодировкеURL);
	
	Метод = "/api/v2.1/films/search-by-keyword";
	
	МетодСФразой = Метод + "?keyword=" + КлючеваяФраза;
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервера, , , , , Истина);
	
	HTTPЗапрос = Новый HTTPЗапрос(МетодСФразой);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("X-API-KEY", Константы.КлючAPIКиноПоиск.Получить());
	
	//@skip-check bsl-legacy-check-dynamic-feature-access - Асинх только на клиенте
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Возврат Ответ;
	ИначеЕсли Ответ.КодСостояния = 404 Тогда
		Возврат 1;
	Иначе
		Возврат 2;
	КонецЕсли;
	
КонецФункции

Функция ЗапросКСерверуПоискАктера(Отправитель, Текст)
	
	АдресСервера = Константы.АдресСервера.Получить();
	КлючеваяФраза = КодироватьСтроку(Текст, СпособКодированияСтроки.URLВКодировкеURL);
	
	Метод = "/api/v1/persons";
	
	МетодСФразой = Метод + "?name=" + КлючеваяФраза;
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервера, , , , , Истина);
	
	HTTPЗапрос = Новый HTTPЗапрос(МетодСФразой);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("X-API-KEY", Константы.КлючAPIКиноПоиск.Получить());
	
	//@skip-check bsl-legacy-check-dynamic-feature-access - Асинх только на клиенте
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Возврат Ответ;
	ИначеЕсли Ответ.КодСостояния = 404 Тогда
		Возврат 1;
	Иначе
		Возврат 2;
	КонецЕсли;
	
КонецФункции

Функция ЗапросДеталейФильмаПоId(Отправитель, FilmId, Страница = Неопределено)
	
	АдресСервера = Константы.АдресСервера.Получить();

	Метод = "/api/v2.2/films/";
	Если Страница = Неопределено Тогда
		МетодСИД = Метод + Строка(FilmId);
	Иначе
		МетодСИД = Метод + Строка(FilmId) + Строка(Страница);
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервера, , , , , Истина);
	
	HTTPЗапрос = Новый HTTPЗапрос(МетодСИД);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("X-API-KEY", Константы.КлючAPIКиноПоиск.Получить());
	
	//@skip-check bsl-legacy-check-dynamic-feature-access - Асинх только на клиенте
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Возврат Ответ;
	Иначе
		ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
		ДополнительныеСвойства.Клавиатура = Клавиатуры.КлавиатураДвеКнопки(КомандаПоискФильма(), КомандаПоискАктёра());
		ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, "😔 Ошибка поиска на сервере.
															|Попробуйте ещё раз.", ДополнительныеСвойства);
		РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.Приветствие);
	КонецЕсли;
КонецФункции

Функция ЗапросДеталейАктераПоId(Отправитель, ActorId, Страница = Неопределено)
	
	АдресСервера = Константы.АдресСервера.Получить();

	Метод = "/api/v1/staff/";
	Если Страница = Неопределено Тогда
		МетодСИД = Метод + Строка(ActorId);
	Иначе
		МетодСИД = Метод + Строка(ActorId) + Строка(Страница);
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервера, , , , , Истина);
	
	HTTPЗапрос = Новый HTTPЗапрос(МетодСИД);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("X-API-KEY", Константы.КлючAPIКиноПоиск.Получить());
	
	//@skip-check bsl-legacy-check-dynamic-feature-access - Асинх только на клиенте
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Возврат Ответ;
	Иначе
		ДополнительныеСвойства = ИнтеграцияТелеграм.ДополнительныеСвойстваИсходящегоСообщения();
		ДополнительныеСвойства.Клавиатура = Клавиатуры.КлавиатураДвеКнопки(КомандаПоискФильма(), КомандаПоискАктёра());
		ИнтеграцияТелеграм.ОтправитьСообщение(Отправитель, "😔 Ошибка поиска на сервере.
															|Попробуйте ещё раз.", ДополнительныеСвойства);
		РаботаСоСтатусом.УстановитьСтатус(Отправитель, Перечисления.СтатусыПоискКино.Приветствие);
	КонецЕсли;
КонецФункции

Функция КомандаПоискФильма() Экспорт
	Возврат "🎬 Поиск фильма";
КонецФункции

Функция КомандаПоискАктёра() Экспорт
	Возврат "🎭 Поиск актёра";
КонецФункции

#КонецОбласти
